In [2]:
"""
날짜 : 2020/08/10
이름 : 이성진
내용 : pandas(파이썬 데이터프레임 패키지) 실습하기
"""

'\n날짜 : 2020/08/10\n이름 : 이성진\n내용 : pandas(파이썬 데이터프레임 패키지) 실습하기\n'

In [3]:
import pandas as pd

In [6]:
#데이터프레임
df1 = pd.DataFrame([[1,2,3],[4,5,6,],[7,8,9]])
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [9]:
df2 = pd.DataFrame({
    'name' : ['김유신', '김춘추', '장보고', '강감찬', '이순신'],
    'age' : [23,25,32,42,37],
    'addr' : ['서울', '대전', '대구', '부산', '광주']
})

df2

  name  age addr
0  김유신   23   서울
1  김춘추   25   대전
2  장보고   32   대구
3  강감찬   42   부산
4  이순신   37   광주

In [14]:
#데이터프레임 출력
print(df1[0][0])
print(df1[0][1])
print(df2['name'])
print(df2['name'][1])

1
4
0    김유신
1    김춘추
2    장보고
3    강감찬
4    이순신
Name: name, dtype: object
김춘추